Tekla Open API Reference for Tekla Structures 2025
EnvironmentFiles.GetMultiDirectoryFileList Method (String)
 Gets a list of files with the given extension from the default search directories.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static List<string> GetMultiDirectoryFileList(
	string fileExtension
)
Public Shared Function GetMultiDirectoryFileList (
	fileExtension As String
) As List(Of String)
Parameters
fileExtension
Type: System.String
The file extension to be used.
Return Value
Type: List<String>
A list of files with the given extension.
See Also
Reference
EnvironmentFiles Class
GetMultiDirectoryFileList Overload
Tekla.Structures.Dialog.UIControls Namespace